namespace Gamza.Enums
{
    public enum JobType
    {
        //1차
        Warrior,
        Mage,
        Archer,
        Thief,
        Healer,

        //2차
        // 검사
        Knight, //성기사 -> 방패 검사 컨셉 (탱커, 어그로맨)
        SpearMan, //탈것을 탄 창기사 -> 탈것을 이용한 기동력 (광역기, 이동속도)
        Ronin, //낭인(방랑기사) -> 발도술 (근접 딜러, 1인기 다수)

        //법사
        ArchMage, //아크메이지 -> 속성 (강력한 광역기)
        DarkMage, //흑마법사 -> 저주 및 디버프 (도트 데미지, 약화)
        TimeMage, //시간마법사 -> 시간 (헤이스트, 슬로우 )

        //  궁수
        Hunter, //헌터 -> 동물을 부리는 궁수 (광역기)
        Sniper, //저격수 -> 저격 (1인기 높은 딜링)
        TrickArcher, //트릭아처 -> 공예 궁수 (빠른 기동력)

        //  도적
        Assassin, //어쎄신 -> (단검을 이용한 빠르고 강력한 공격)
        ShadowDancer, //쉐도우댄서 (기동성을 살린 원거리 도적)
        Phantom, //괴도 -> (속임수와 교란, 함정을 사용하는 도적)

        //  힐러
        Cleric, //클래릭 -> 빛속성 힐러 (정통힐러)
        Onmyoji, //음양사 -> 부적을 이용한 힐러 (부적 투척)
        Alchemist, //연금술사 -> 과학과 연금술을 이용한 힐러 (표션, 기계장치)

        //3차
        // 검사
        Paladin, // 팔라딘 테크 -> 빛 속성, 데미지를 축적해 한방을 터트리는 직업
        DragonKnight, // 창기사 테크 -> 드래곤(마법)과의 연계스킬 (마검사)
        Blade, // 낭인 테크 -> 콤보 스텍 형 검사

        //법사
        GrandSorcerer, //아크메이지 테크 -> 속성 (강력한 광역기)
        NecroMancer, //흑마법사테크 -> 1인군단 (탱커, 딜러, 법사 해골을 소환, 자체 흡혈 기능 추가)
        ChronoTrigger, //시간법사 테크 -> 시간 (시간 정지)

        //궁수
        BeastMaster, //헌터 테크 -> 동물과의 상호작용
        DeadEye, // 저격수 테크 -> 원거리 관통
        Mirage, //트릭아처 테크 -> 환영을 이용하는 교란형 궁수

        //도적
        Reaper, //어쎄신 테크 -> (즉사기를 보유한 강력한 근접도적)
        Specter, //쉐도우댄서 테크 -> (그림자를 이용한 설치기, 타격기)
        Raven, //괴도 테크 -> (화려함 강조)

        //힐러
        Priest, //클래릭 테크 -> 기도를 통한 버프 및 힐
        Sorcerer, //음양사 테크 -> 주령을 이용한 버프 및 힐
        Homunculus, //연금술사 테크 -> 기계과 제작을 이용한 버프 및 힐
    }
}
